---
kind: method
id: M:Autodesk.Revit.DB.ColorFillSchemeEntry.GetStringValue
source: html/e7cfd4ce-57b7-d4a9-389b-83dcfc581fa5.htm
---
# Autodesk.Revit.DB.ColorFillSchemeEntry.GetStringValue Method

Gets the String value stored within the entry.

## Syntax (C#)
```csharp
public string GetStringValue()
```

## Returns
The String contained in the entry.

## Remarks
This method should only be used if the StorageType property reports the type of the entry as a String.